#+PROPERTY: header-args:emacs-lisp :results silent

** Cider
#+BEGIN_SRC elisp
(defun replace-defun-comment (buffer value)
  (with-current-buffer buffer
    (save-excursion
      (save-match-data
        (end-of-defun)
        (backward-char)
        (comment-kill nil)
        (just-one-space 0)
        (insert " ; => ")
        (insert value)))))

(defun cider-insert-defun-comment-eval-handler (buffer)
  (nrepl-make-response-handler
   buffer
   (lambda (buffer value)
     (replace-defun-comment buffer value))
   (lambda (_buffer out)
     (cider-emit-interactive-eval-output out))
   (lambda (_buffer err)
     (cider-emit-interactive-eval-output err))
   nil))

(defun cider-eval-defun-at-point-and-insert-as-comment ()
  (interactive)
  (cider-eval (cider-defun-at-point)
              (cider-insert-defun-comment-eval-handler (current-buffer))
              (cider-current-ns)))

(add-hook
 'cider-mode-hook
 (lambda ()
   (local-set-key (kbd "S-C-M-x")
                  #'cider-eval-defun-at-point-and-insert-as-comment)))
#+END_SRC

#+RESULTS:
| lambda | nil | (local-set-key (kbd S-C-M-x) (function cider-eval-defun-at-point-and-insert-as-comment)) |

